#include <stdio.h>

int main()
{
    printf("中文测试");
}



// @快捷键
// F5快捷键运行
// Alt+Shift+F一键美化代码
// Alt+Shift+↑/↓快捷复制代码
// 三击末尾选择此行
// 按住Alt+←/→快捷切换标签页
// 按住Ctrl+←/→快捷移动光标（根据单词区分）
// Ctrl+B显示/隐藏左边的栏
// 有些快捷键在右键菜单有显示，自己摸索模式，这几个是比较常见的
// Ctrl+Z/Y撤回/取消撤回
// ACV最常用的几个

// @插件（扩展）
// 敲代码不舒服的时候记得在这里搜索一些扩展
// 这些扩展是刚刚运行C的时候自动推荐的，我也给你装了，更多扩展推荐可以自己搜
// 温馨提示：扩展不要装太多，按需求装，装多了会卡

// @运行
// 运行之后就会出现下面的窗口，这几个选项对你来说，大部分用不上，只有终端是你用得上的
// 有的时候如果点了运行后没正常运行，可能是冲突了，可以点右边的全部删掉，然后重新运行
// 有的时候，别人给你发的代码可能会输出乱码，这个时候直接搜索“C输出乱码”、“vscode C输出乱码”、“mingw编译乱码”等等，跟着教程做
// 等你遇到这些问题的时候你会感谢我的

// @其他
// 记得经常按Ctrl+S保存代码，防止出意外
// 修改过的代码会提示圆圈，保存后会显示×
// 学敲代码之前，我建议先学git

// @git
// 只要你的代码有修改，就会在git显示出来
// git会帮你保存代码更新，相当于备份，防止某次改代码的时候改废了，然后就能用git复原
// 假如你现在需要备份这个代码，你就给他暂存，可以全部暂存，也可以只选择部分文件
// 暂存之后写个名字，用来告诉自己这次备份是什么
// 遇到提示未保存的情况可以自己选择，你操作一下
// 现在就相当于备份了，但是我建议.gitignore文件也要一起
// 你提交的都会有显示，比如我这里再提交一次
// 如果你需要回档(vscode好像不太好搞)算了，还是给你装个github吧

//修改了一点东西